<?php
/*::::::::::::::::::::::::::::::::::::::::
 System name: cpengine
 Short Desc: Full Russian Security Power Pack
 Version: 2.0 (Service Pack 2)
 Authors:  Arcanum (php@211.ru) &  Censored!
 Date: March 18, 2008
::::::::::::::::::::::::::::::::::::::::*/

// группа: Администратор
$default_mask['1'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"1," . // Скачивать прикрепленные файлы
"1," . // Создавать темы
"1," . // Отвечать в своих темах
"1," . // Отвечать в темах других пользователей
"1," . // Прикреплять файлы
"1," . // Оценивать темы
"1," . // Редактировать свои сообщения
"1," . // Удалять свои сообщения
"1," . // Переносить свои темы
"1," . // Открывать / Закрывать свои темы
"1," . // Удалять свои темы
"1," . // Удалять сообщения других пользователей
"1," . // Редактировать сообщения других пользователей
"1," . // Открывать закрытые темы других пользователей
"1," . // Закрывать темы других пользователей
"1," . // Изменять тип темы
"1," . // Переносить темы других пользователей
"1";   // Удалять темы других пользователей


// группа: Гость
$default_mask['2'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей


// группа: Редактор
$default_mask['3'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"1," . // Скачивать прикрепленные файлы
"1," . // Создавать темы
"1," . // Отвечать в своих темах
"1," . // Отвечать в темах других пользователей
"1," . // Прикреплять файлы
"1," . // Оценивать темы
"1," . // Редактировать свои сообщения
"1," . // Удалять свои сообщения
"1," . // Переносить свои темы
"1," . // Открывать / Закрывать свои темы
"1," . // Удалять свои темы
"1," . // Удалять сообщения других пользователей
"0," . // Редактировать сообщения других пользователей
"0," . // Открывать закрытые темы других пользователей
"0," . // Закрывать темы других пользователей
"1," . // Изменять тип темы
"1," . // Переносить темы других пользователей
"1";   // Удалять темы других пользователей


// группа: Пользователь
$default_mask['4'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"1," . // Скачивать прикрепленные файлы
"1," . // Создавать темы
"1," . // Отвечать в своих темах
"1," . // Отвечать в темах других пользователей
"1," . // Прикреплять файлы
"1," . // Оценивать темы
"1," . // Редактировать свои сообщения
"1," . // Удалять свои сообщения
"1," . // Переносить свои темы
"1," . // Открывать / Закрывать свои темы
"0," . // Удалять свои темы
"0," . // Удалять сообщения других пользователей
"0," . // Редактировать сообщения других пользователей
"0," . // Открывать закрытые темы других пользователей
"0," . // Закрывать темы других пользователей
"0," . // Изменять тип темы
"0," . // Переносить темы других пользователей
"0";   // Удалять темы других пользователей


// группа: ????
$default_mask['5'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей


// группа: ????
$default_mask['6'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей


// группа: ????
$default_mask['7'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей


// группа: ????
$default_mask['8'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей


// группа: ????
$default_mask['9'] =
"1," . // Просматривать форум
"1," . // Просматривать темы других пользователей
"1," . // kann loeschkommentar sehen ( wird benutzt )
"1," . // kann forum durchsuchen
"0," . // Скачивать прикрепленные файлы
"0," . // Создавать темы
"0," . // Отвечать в своих темах
"0," . // Отвечать в темах других пользователей
"," .  // Прикреплять файлы
"," .  // Оценивать темы
"," .  // Редактировать свои сообщения
"," .  // Удалять свои сообщения
"," .  // Переносить свои темы
"," .  // Открывать / Закрывать свои темы
"," .  // Удалять свои темы
"," .  // Удалять сообщения других пользователей
"," .  // Редактировать сообщения других пользователей
"," .  // Открывать закрытые темы других пользователей
"," .  // Закрывать темы других пользователей
"," .  // Изменять тип темы
"," .  // Переносить темы других пользователей
"";    // Удалять темы других пользователей

?>